*> Brendon Kupsch
*> COBOL Caesar Cipher

IDENTIFICATION DIVISION.
PROGRAM-ID. CaesarCipher.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-STRING PIC X(3) VALUE 'HAL'.
01 WS-DECRYPT-STRING PIC X(3) VALUE 'IBM'.
01 WS-SHIFT PIC 9(3) COMP VALUE 1.
01 WS-INDEX PIC 9.
01 WS-CHAR PIC X.
01 WS-ASCII PIC 9(3) COMP.
01 WS-NEW-STRING PIC X(3).
01 WS-DECRYPTED-STRING PIC X(3).

PROCEDURE DIVISION.
PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > 3
    MOVE WS-STRING(WS-INDEX:1) TO WS-CHAR
    IF WS-CHAR NOT < 'A' AND WS-CHAR NOT > 'Z'
        MOVE FUNCTION ORD(WS-CHAR) TO WS-ASCII
        ADD WS-SHIFT TO WS-ASCII
        IF WS-ASCII > FUNCTION ORD('Z')
            SUBTRACT 26 FROM WS-ASCII
        END-IF
        MOVE FUNCTION CHAR(WS-ASCII) TO WS-CHAR
    END-IF
    MOVE WS-CHAR TO WS-NEW-STRING(WS-INDEX:1)
END-PERFORM.

PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > 3
    MOVE WS-DECRYPT-STRING(WS-INDEX:1) TO WS-CHAR
    IF WS-CHAR NOT < 'A' AND WS-CHAR NOT > 'Z'
        MOVE FUNCTION ORD(WS-CHAR) TO WS-ASCII
        SUBTRACT WS-SHIFT FROM WS-ASCII
        IF WS-ASCII < FUNCTION ORD('A')
            ADD 26 TO WS-ASCII
        END-IF
        MOVE FUNCTION CHAR(WS-ASCII) TO WS-CHAR
    END-IF
    MOVE WS-CHAR TO WS-DECRYPTED-STRING(WS-INDEX:1)
END-PERFORM.

DISPLAY 'Original String: ' WS-STRING.
DISPLAY 'Shifted String: ' WS-NEW-STRING.
DISPLAY 'Decrypted String: ' WS-DECRYPTED-STRING.

STOP RUN.